HELYXcore-4.4.0/examples/legacy/combustion/PDRFoam/flamePropagationWithObstacles/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel PDRkEpsilon;

    PDRkEpsilonCoeffs
    {
        Cmu              0.09;
        C1               1.44;
        C2               1.92;
        C3               0;
        C4               0.1;
        alphah           1;
        alphak           1;
        alphaEps         0.76923;
    }

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
