HELYXcore-4.4.0/examples/legacy/combustion/PDRFoam/flamePropagationWithObstacles/0.orig/CR
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      CR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<symmTensor>
8025
(
(98.997697 0 0 77.711245 0 30.754852)
(0.015246 0 0 1.4392388e+11 0 1125966.6)
(0.012289 0 0 3.9923036e+08 0 4775.9376)
(13.290695 0 0 7.996499 0 10.003683)
(5.215724 0 0 6.291483 0 7.908581)
(1.7686897e+11 0 0 0 0 1.8812311e+11)
(0.029204 0 0 0 0 0.409114)
(0.005865 0 0 79839303 0 0.477199)
...
)
;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   ( 0 0 0 0 0 0 );
        value               uniform ( 0 0 0 0 0 0 );
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleWall
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
