HELYXcore-4.4.0/examples/legacy/combustion/PDRFoam/flamePropagationWithObstacles/0.orig/nsv
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      nsv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor>
8025
(
(0.634791 0 0 0.634791 0 0.03)
(0.134791 0 0 -0.115209 0 -0.72)
(0.192395 0 0 -0.057605 0 -0.36)
(0.732081 0 0 -0.230419 0 0.83)
(0.827186 0 0 0.014686 0 0.8375)
(-0.115209 0 0 0.134791 0 -0.72)
(0 0 0 0 0 0)
(-0.057605 0 0 -0.057605 0 -0.36)
...
)
;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   ( 0 0 0 0 0 0 );
        value               uniform ( 0 0 0 0 0 0 );
    }
    ground
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    blockedFaces
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleWall
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
