HELYXcore-4.4.0/examples/legacy/combustion/PDRFoam/flamePropagationWithObstacles/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   4;

method               simple;

simpleCoeffs
{
    n                    (2 2 1);
}

hierarchicalCoeffs
{
    n                    (2 2 1);
    order                xyz;
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
