HELYXcore-4.4.0/examples/legacy/combustion/PDRFoam/flamePropagationWithObstacles/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name    blockedFacesSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (1 1 0.99) (2 2 1);
        }
    }

    {
        name    blockedCellsSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (2.4 2.4 0) (3 3 1);
        }
    }

    {
        name    blockedCellsSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 0) (0.6 0.6 1);
        }
    }

    {
        name    blockedFacesSet;
        type    faceSet;
        action  add;
        source  cellToFace;
        sourceInfo
        {
            set     blockedCellsSet;
            option  all;
        }
    }

    {
        name    coupledFacesSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (1.0 1.99 0) (2.0 2.09 0.6);
        }
    }

);

// ************************************************************************* //
